# coding=utf-8

pre_list = [
    {"score": 0.2, "text": 'מִזְמוֹר'},
    {"score": 0.1, "text": 'שִׁיר הַמַּעֲלוֹת'},
    {"score": 0.09, "text": 'מִזְמוֹר שִׁיר'},
    {"score": 0.09, "text": 'שִׁיר מִזְמוֹר'},
    {"score": 0.13, "text": 'מַשְׂכִּיל'},
    {"score": 0.06, "text": 'מִכְתָּם'},
    {"score": 0.05, "text": 'תְּפִלָּה'},
    {"score": 0.01, "text": 'שִׁגָּיוֹן'},
    {"score": 0.01, "text": 'שִׁירָה'},
    {"score": 0.01, "text": 'תְּהִלָּה'},
    {"score": 0.05, "text": 'לַמְנַצֵּחַ בִּנְגִינוֹת'},
    {"score": 0.01, "text": 'לַמְנַצֵּחַ אֶל-הַנְּחִילוֹת'},
    {"score": 0.01, "text": 'לַמְנַצֵּחַ בִּנְגִינוֹת עַל-הַשְּׁמִינִית'},
    {"score": 0.01, "text": 'לַמְנַצֵּחַ עַל-הַשְּׁמִינִית'},
    {"score": 0.03, "text": 'לַמְנַצֵּחַ עַל-הַגִּתִּית'},
    {"score": 0.01, "text": 'לַמְנַצֵּחַ עַל-מוּת לַבֵּן'},
    {"score": 0.01, "text": 'לַמְנַצֵּחַ עַל-אַיֶּלֶת הַשַּׁחַר'},
    {"score": 0.02, "text": 'לַמְנַצֵּחַ עַל-שׁוֹשַׁנִּים'},
    {"score": 0.01, "text": 'לַמְנַצֵּחַ עַלְמוּת'},
    {"score": 0.01, "text": 'לַמְנַצֵּחַ עַל מָחֲלַת'},
    {"score": 0.01, "text": 'לַַמְנַצֵּחַ, עַל-יוֹנַת אֵלֶם רְחֹקִים'},
    {"score": 0.04, "text": 'ַמְנַצֵּחַ אַל-תַּשְׁחֵת'},
    {"score": 0.01, "text": 'לַמְנַצֵּחַ על שושן עֵדוּת'},
    {"score": 0.01, "text": 'לַמְנַצֵּחַ עַל נגינַת'},
    {"score": 0.01, "text": 'לַמְנַצֵּחַ אל שׁוֹשַׁנִּים עֵדוּת'},
]

post_list = [
    {"score": 0.3, "text": 'דָוִד'},
    {"score": 0.2, "text": 'אָסָף'},
    {"score": 0.15, "text": 'בְנֵי-קֹרַח'},
    {"score": 0.15, "text": 'שְׁלֹמֹה'},
    {"score": 0.1, "text": 'אֵיתָן הָאֶזְרָחִי'},
    {"score": 0.1, "text": 'ְמֹשֶׁה'}
]

join_char = 'ל'
